---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined
source: html/4ec8bac6-d1ed-fce6-d1cf-20d8d50afdff.htm
---
# StructuralSectionUserDefined Properties

Common set of parameters for structural analysis.